In [1]:
import pandas as pd

### 1. Ingest a list as pandas record

In [9]:
from typing import Any, List

def get_pandas(lst: List[List[Any]], columns: List[str]) -> pd.DataFrame:
    return pd.DataFrame(lst, columns=columns)


data = [
    [1, "John Doe", "johndoe@fakemail.com", 29],
    [2, "Loren Ipsum", "lorenipsum@fakemail.com", 32]
]

columns = ["id", "name", "email", "age"]

df = get_pandas(data,  columns)

display(df)

   id         name                    email  age
0   1     John Doe     johndoe@fakemail.com   29
1   2  Loren Ipsum  lorenipsum@fakemail.com   32

### 2. Remove duplicate rows in pandas

In [8]:

data = [
    [1, "John Doe", "johndoe@fakemail.com", 29],
    [2, "Loren Ipsum", "lorenipsum@fakemail.com", 32],
    [2, "Hello World", "lorenipsum@fakemail.com", 32]
]

df_dup = get_pandas(data,  columns)

def remove_duplicate(df: pd.DataFrame) -> pd.DataFrame:
    df.drop_duplicates(subset='email', inplace=True)
    return df

df_w_dupe = remove_duplicate(df_dup)

display(df_w_dupe)

   id         name                    email  age
0   1     John Doe     johndoe@fakemail.com   29
1   2  Loren Ipsum  lorenipsum@fakemail.com   32

### 3. Get size of Dataframe

In [11]:
def getDataframeSize(players: pd.DataFrame) -> List[int]:
    return list(players.shape)

assert getDataframeSize(df_w_dupe) == [2,4]

### 4. Get first 2 row of a df

In [12]:
def selectFirstRows(employees: pd.DataFrame, topn: int) -> pd.DataFrame:
    return employees.head(topn)

display(selectFirstRows(df_dup, 2))

   id         name                    email  age
0   1     John Doe     johndoe@fakemail.com   29
1   2  Loren Ipsum  lorenipsum@fakemail.com   32

### 5. Select data

In [13]:
data = [
    [101, "Ulysses", 13],
    [53, "Williams", 10],
    [128, "Henry", 6],
    [3, "Henry", 11]
]

df = pd.DataFrame(data, columns=["student_id", "name", "age"])

# select the row where student id is 101

def get_student_by_id(student_id: int) -> pd.DataFrame:
    return df.loc[df['student_id'] == student_id, ['name', 'age']]

display(get_student_by_id(101))

      name  age
0  Ulysses   13